# MaxHookExtensionMultiplierWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..MaxHookExtensionMultiplierWarn Property
BuiltInFailures..::..RebarFailures Class See Also
---
The allowable range of values for the Rebar Hook Extension Multiplier is from 0.01 to 99.0.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MaxHookExtensionMultiplierWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MaxHookExtensionMultiplierWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MaxHookExtensionMultiplierWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace